case/Allrun
#!/bin/sh


transformPoints -scale 1e-3


#------------------------------------------------------------------------------
