case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian; //CrossBirdCarreau;
nu [ 0 2 -1 0 0 0 0 ] 55.8; 

CrossBirdCarreauCoeffs  
{
    nu0    [ 0 2 -1 0 0 0 0 ] 55.8;           	//viscosity at zero shear stress
    nuInf  [ 0 2 -1 0 0 0 0 ] 0;                	//viscosity at infinite shear stress
    k      [ 0 0  1 0 0 0 0 ] 3.21;             	//relaxation time in seconds
    n      [ 0 0  0 0 0 0 0 ] 0.3014;           	//power index
    a      [ 0 0  0 0 0 0 0 ] 2;               	//dimless scalar
}

    DT    DT [ 0 2 -1  0 0 0 0 ] 1.29e-7;		// k/rho.cp 
    cp    cp [ 0 2 -2 -1 0 0 0 ] 1808;           	// cp for polycarbonate 

// ************************************************************************* //

