case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.1;
    }
    Phi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.0;
    }
    T
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-5;
        relTol            0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        T               1e-5;
    }
}

// relaxationFactors
// {
    
    
//     equations
//     {
//         U               0.9; // 0.9 is more stable but 0.95 more convergent
//         ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
//     }
// }

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
       ".*"             0.7;
        T               0.7;
    }
}


// ************************************************************************* //
